Revit 2024 API
BuiltInFailures.AnalyticalModelFailures.SupportCheckDone Property
 Member support check is complete. No unsupported elements detected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SupportCheckDone { get; }
Visual Basic
Public Shared ReadOnly Property SupportCheckDone As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SupportCheckDone {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace